RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
/*
 * CherryUSB UVC Host Display Layer
 *
 * Renders UVC YUYV or MJPEG frames to the 512x800 RGB565 LCD.
 * YUYV pixels are converted to RGB565 on the fly.
 * MJPEG frames are decoded with TJpgDec into a temporary RGB565 surface,
 * then scaled to the LCD using the same nearest-neighbour path.
 */

#include <rtthread.h>
#include <string.h>
#include <board.h>
#include "cy_graphics.h"
#include "usbh_uvc_stream.h"
#include "tjpgd.h"

#undef  USB_DBG_TAG
#define USB_DBG_TAG "uvc_disp"
#include "usb_log.h"

/* LCD dimensions (portrait mode as configured in drv_lcd.c) */
#define LCD_W   512
#define LCD_H   800
#define LCD_STRIDE          512U
#define LCD_BITS_PER_PIXEL  16U
#define LCD_BUF_SIZE        (LCD_STRIDE * LCD_H * LCD_BITS_PER_PIXEL / 8U)

#define UVC_ITCM_SECTION __attribute__((section(".cy_itcm")))
#define UVC_DTCM_SECTION __attribute__((section(".cy_dtcm")))
#define UVC_SHARED_SECTION __attribute__((section(".m33_m55_shared_hyperram")))

#define UVC_MJPEG_WORKBUF_SIZE   4096U
#define UVC_MJPEG_MAX_FRAME_SIZE (128U * 1024U)
#define UVC_MJPEG_MAX_WIDTH      640U
#define UVC_MJPEG_MAX_HEIGHT     480U
#define UVC_MJPEG_MAX_PIXELS     (UVC_MJPEG_MAX_WIDTH * UVC_MJPEG_MAX_HEIGHT)

static uint16_t   *lcd_fb;          /* pointer into LCD framebuffer */
static uint32_t    lcd_fb_size;     /* bytes */
static rt_bool_t   g_uvc_lcd_hw_ready;

static GFXSS_Type *g_uvc_gfxbase = (GFXSS_Type*)GFXSS;
static cy_stc_gfx_context_t g_uvc_gfx_context;
CY_SECTION(".cy_gpu_buf") static uint8_t g_uvc_lcd_fb_mem[LCD_BUF_SIZE] __attribute__((aligned(128))) = {0};

struct uvc_update_rect {
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
};

struct uvc_mjpeg_decoder {
    const uint8_t *src;
    uint32_t src_size;
    uint32_t src_offset;
    uint16_t width;
    uint16_t height;
    uint16_t *dst_rgb565;
};

struct uvc_mjpeg_header_info {
    uint32_t soi_offset;
    uint32_t sos_offset;
    uint32_t eoi_offset;
    rt_bool_t has_sof0;
    rt_bool_t has_dqt;
    rt_bool_t has_dht;
    rt_bool_t has_sos;
    rt_bool_t has_eoi;
};

struct uvc_mjpeg_validate_info {
    uint16_t width;
    uint16_t height;
    uint8_t ncomp;
    uint8_t qt_mask;
    uint8_t dc_mask;
    uint8_t ac_mask;
    uint8_t sos_mask;
    uint16_t marker_count;
};

struct uvc_display_context {
    uint16_t src_w;
    uint16_t src_h;
    uint16_t dst_w;
    uint16_t dst_h;
    uint16_t y_offset;
    uint32_t src_stride;
    rt_bool_t prepared;
    rt_bool_t background_synced;
    struct uvc_update_rect update_rect;
    uint32_t row_offsets[LCD_H];
    uint16_t x_offsets[LCD_W];
    uint16_t pair_offsets[LCD_W];
    uint8_t y_offsets[LCD_W];
};

static UVC_DTCM_SECTION struct uvc_display_context g_uvc_display_ctx;
static UVC_DTCM_SECTION uint8_t g_uvc_mjpeg_workbuf[UVC_MJPEG_WORKBUF_SIZE];
static UVC_DTCM_SECTION rt_bool_t g_uvc_yuv_lut_ready;
static UVC_DTCM_SECTION int32_t g_uvc_y_lut[256];
static UVC_DTCM_SECTION int32_t g_uvc_u_to_b_lut[256];
static UVC_DTCM_SECTION int32_t g_uvc_u_to_g_lut[256];
static UVC_DTCM_SECTION int32_t g_uvc_v_to_r_lut[256];
static UVC_DTCM_SECTION int32_t g_uvc_v_to_g_lut[256];
static UVC_DTCM_SECTION uint8_t g_uvc_mjpeg_diag_budget = 8U;
static UVC_SHARED_SECTION uint16_t g_uvc_mjpeg_rgb565[UVC_MJPEG_MAX_PIXELS];
static UVC_SHARED_SECTION uint8_t g_uvc_mjpeg_frame[UVC_MJPEG_MAX_FRAME_SIZE];

#define UVC_MJPEG_STD_DHT_SIZE 420U

static const uint8_t g_uvc_dht_bits_dc_luma[16] = {
    0x00, 0x01, 0x05, 0x01, 0x01, 0x01, 0x01, 0x01,
    0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const uint8_t g_uvc_dht_val_dc_luma[12] = {
    0x00, 0x01, 0x02, 0x03, 0x04, 0x05,
    0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b
};

static const uint8_t g_uvc_dht_bits_ac_luma[16] = {
    0x00, 0x02, 0x01, 0x03, 0x03, 0x02, 0x04, 0x03,
    0x05, 0x05, 0x04, 0x04, 0x00, 0x00, 0x01, 0x7d
};

static const uint8_t g_uvc_dht_val_ac_luma[162] = {
    0x01, 0x02, 0x03, 0x00, 0x04, 0x11, 0x05, 0x12,
    0x21, 0x31, 0x41, 0x06, 0x13, 0x51, 0x61, 0x07,
    0x22, 0x71, 0x14, 0x32, 0x81, 0x91, 0xa1, 0x08,
    0x23, 0x42, 0xb1, 0xc1, 0x15, 0x52, 0xd1, 0xf0,
    0x24, 0x33, 0x62, 0x72, 0x82, 0x09, 0x0a, 0x16,
    0x17, 0x18, 0x19, 0x1a, 0x25, 0x26, 0x27, 0x28,
    0x29, 0x2a, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39,
    0x3a, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49,
    0x4a, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58, 0x59,
    0x5a, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68, 0x69,
    0x6a, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79,
    0x7a, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89,
    0x8a, 0x92, 0x93, 0x94, 0x95, 0x96, 0x97, 0x98,
    0x99, 0x9a, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7,
    0xa8, 0xa9, 0xaa, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6,
    0xb7, 0xb8, 0xb9, 0xba, 0xc2, 0xc3, 0xc4, 0xc5,
    0xc6, 0xc7, 0xc8, 0xc9, 0xca, 0xd2, 0xd3, 0xd4,
    0xd5, 0xd6, 0xd7, 0xd8, 0xd9, 0xda, 0xe1, 0xe2,
    0xe3, 0xe4, 0xe5, 0xe6, 0xe7, 0xe8, 0xe9, 0xea,
    0xf1, 0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8,
    0xf9, 0xfa
};

static const uint8_t g_uvc_dht_bits_dc_chroma[16] = {
    0x00, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01, 0x01,
    0x01, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00
};

static const uint8_t g_uvc_dht_val_dc_chroma[12] = {
    0x00, 0x01, 0x02, 0x03, 0x04, 0x05,
    0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b
};

static const uint8_t g_uvc_dht_bits_ac_chroma[16] = {
    0x00, 0x02, 0x01, 0x02, 0x04, 0x04, 0x03, 0x04,
    0x07, 0x05, 0x04, 0x04, 0x00, 0x01, 0x02, 0x77
};

static const uint8_t g_uvc_dht_val_ac_chroma[162] = {
    0x00, 0x01, 0x02, 0x03, 0x11, 0x04, 0x05, 0x21,
    0x31, 0x06, 0x12, 0x41, 0x51, 0x07, 0x61, 0x71,
    0x13, 0x22, 0x32, 0x81, 0x08, 0x14, 0x42, 0x91,
    0xa1, 0xb1, 0xc1, 0x09, 0x23, 0x33, 0x52, 0xf0,
    0x15, 0x62, 0x72, 0xd1, 0x0a, 0x16, 0x24, 0x34,
    0xe1, 0x25, 0xf1, 0x17, 0x18, 0x19, 0x1a, 0x26,
    0x27, 0x28, 0x29, 0x2a, 0x35, 0x36, 0x37, 0x38,
    0x39, 0x3a, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48,
    0x49, 0x4a, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58,
    0x59, 0x5a, 0x63, 0x64, 0x65, 0x66, 0x67, 0x68,
    0x69, 0x6a, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78,
    0x79, 0x7a, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87,
    0x88, 0x89, 0x8a, 0x92, 0x93, 0x94, 0x95, 0x96,
    0x97, 0x98, 0x99, 0x9a, 0xa2, 0xa3, 0xa4, 0xa5,
    0xa6, 0xa7, 0xa8, 0xa9, 0xaa, 0xb2, 0xb3, 0xb4,
    0xb5, 0xb6, 0xb7, 0xb8, 0xb9, 0xba, 0xc2, 0xc3,
    0xc4, 0xc5, 0xc6, 0xc7, 0xc8, 0xc9, 0xca, 0xd2,
    0xd3, 0xd4, 0xd5, 0xd6, 0xd7, 0xd8, 0xd9, 0xda,
    0xe2, 0xe3, 0xe4, 0xe5, 0xe6, 0xe7, 0xe8, 0xe9,
    0xea, 0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8,
    0xf9, 0xfa
};

static const char *uvc_mjpeg_result_string(JRESULT result)
{
    switch (result) {
    case JDR_OK:
        return "ok";
    case JDR_INTR:
        return "interrupted";
    case JDR_INP:
        return "input";
    case JDR_MEM1:
        return "mem1";
    case JDR_MEM2:
        return "mem2";
    case JDR_PAR:
        return "param";
    case JDR_FMT1:
        return "fmt1";
    case JDR_FMT2:
        return "fmt2";
    case JDR_FMT3:
        return "fmt3";
    default:
        return "unknown";
    }
}

static const char *uvc_mjpeg_validate_jpeg(const uint8_t *jpeg, uint32_t jpeg_size,
                                           struct uvc_mjpeg_validate_info *info)
{
    uint32_t offset;

    if ((jpeg == RT_NULL) || (jpeg_size < 4U) || (info == RT_NULL)) {
        return "param";
    }

    memset(info, 0, sizeof(*info));

    if ((jpeg[0] != 0xffU) || (jpeg[1] != 0xd8U)) {
        return "soi";
    }

    offset = 2U;
    while ((offset + 3U) < jpeg_size) {
        uint16_t marker;
        uint16_t seg_len;
        const uint8_t *seg;
        uint32_t ndata;

        if (jpeg[offset] != 0xffU) {
            return "marker-prefix";
        }

        while (((offset + 1U) < jpeg_size) && (jpeg[offset + 1U] == 0xffU)) {
            offset++;
        }

        if ((offset + 3U) >= jpeg_size) {
            return "marker-trunc";
        }

        marker = (uint16_t)(((uint16_t)jpeg[offset] << 8) | jpeg[offset + 1U]);
        seg_len = (uint16_t)(((uint16_t)jpeg[offset + 2U] << 8) | jpeg[offset + 3U]);
        if ((seg_len <= 2U) || ((marker >> 8) != 0xffU)) {
            return "marker-len";
        }
        if ((offset + 2U + seg_len) > jpeg_size) {
            return "segment-overrun";
        }

        info->marker_count++;
        seg = jpeg + offset + 4U;
        ndata = (uint32_t)seg_len - 2U;

