RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
        switch (marker & 0xffU) {
        case 0xc0: {
            uint8_t i;

            if (ndata < 6U) {
                return "sof0-short";
            }

            info->height = (uint16_t)(((uint16_t)seg[1] << 8) | seg[2]);
            info->width = (uint16_t)(((uint16_t)seg[3] << 8) | seg[4]);
            info->ncomp = seg[5];
            if ((info->ncomp != 1U) && (info->ncomp != 3U)) {
                return "sof0-ncomp";
            }
            if ((info->width == 0U) || (info->height == 0U)) {
                return "sof0-size";
            }
            if (ndata < (uint32_t)(6U + 3U * info->ncomp)) {
                return "sof0-trunc";
            }

            for (i = 0U; i < info->ncomp; i++) {
                uint8_t samp = seg[7U + 3U * i];
                uint8_t qid = seg[8U + 3U * i];

                if (qid > 3U) {
                    return "sof0-qid";
                }
                if (i == 0U) {
                    if ((samp != 0x11U) && (samp != 0x22U) && (samp != 0x21U)) {
                        return "sof0-y-samp";
                    }
                } else if (samp != 0x11U) {
                    return "sof0-c-samp";
                }

                info->qt_mask |= (uint8_t)(1U << qid);
            }
        } break;

        case 0xdb: {
            const uint8_t *d = seg;
            uint32_t left = ndata;

            while (left > 0U) {
                uint8_t prop;
                uint8_t precision;
                uint8_t qid;
                uint32_t table_size;

                if (left < 65U) {
                    return "dqt-short";
                }

                prop = *d++;
                left--;
                precision = (uint8_t)(prop >> 4);
                qid = (uint8_t)(prop & 0x0fU);
                if (precision != 0U) {
                    return "dqt-precision";
                }
                if (qid > 3U) {
                    return "dqt-qid";
                }

                table_size = 64U;
                if (left < table_size) {
                    return "dqt-data";
                }
                d += table_size;
                left -= table_size;
                info->qt_mask |= (uint8_t)(1U << qid);
            }
        } break;

        case 0xc4: {
            const uint8_t *d = seg;
            uint32_t left = ndata;

            while (left > 0U) {
                uint8_t prop;
                uint8_t cls;
                uint8_t num;
                uint32_t np = 0U;
                uint8_t i;

                if (left < 17U) {
                    return "dht-short";
                }

                prop = *d++;
                left--;
                if ((prop & 0xeeU) != 0U) {
                    return "dht-id";
                }
                cls = (uint8_t)(prop >> 4);
                num = (uint8_t)(prop & 0x0fU);

                for (i = 0U; i < 16U; i++) {
                    np += *d++;
                }
                left -= 16U;

                if (left < np) {
                    return "dht-data";
                }

                for (i = 0U; i < np; i++) {
                    uint8_t value = d[i];
                    if ((cls == 0U) && (value > 11U)) {
                        return "dht-dc";
                    }
                }

                if (cls == 0U) {
                    info->dc_mask |= (uint8_t)(1U << num);
                } else {
                    info->ac_mask |= (uint8_t)(1U << num);
                }

                d += np;
                left -= np;
            }
        } break;

        case 0xda: {
            uint8_t i;

            if (ndata < 1U) {
                return "sos-short";
            }
            if ((info->width == 0U) || (info->height == 0U)) {
                return "sos-before-sof0";
            }
            if (seg[0] != info->ncomp) {
                return "sos-ncomp";
            }
            if (ndata < (uint32_t)(1U + 2U * info->ncomp + 3U)) {
                return "sos-trunc";
            }

            for (i = 0U; i < info->ncomp; i++) {
                uint8_t sel = seg[2U + 2U * i];
                uint8_t qid = (uint8_t)((info->qt_mask >> i) & 0x01U);
                (void)qid;

                if ((sel != 0x00U) && (sel != 0x11U)) {
                    return "sos-hsel";
                }

                info->sos_mask |= (uint8_t)(1U << i);
            }

            if ((info->dc_mask & 0x01U) == 0U || (info->ac_mask & 0x01U) == 0U) {
                return "sos-y-huff-missing";
            }
            if ((info->ncomp > 1U) && (((info->dc_mask & 0x02U) == 0U) || ((info->ac_mask & 0x02U) == 0U))) {
                return "sos-c-huff-missing";
            }
            return RT_NULL;
        }

        default:
            break;
        }

        offset += 2U + seg_len;
    }

    return "no-sos";
}

static rt_bool_t uvc_mjpeg_parse_header(const uint8_t *src, uint32_t src_size,
                                        struct uvc_mjpeg_header_info *info)
{
    uint32_t offset;

    if ((src == RT_NULL) || (src_size < 4U) || (info == RT_NULL)) {
        return RT_FALSE;
    }

    memset(info, 0, sizeof(*info));
    info->soi_offset = src_size;
    info->sos_offset = src_size;
    info->eoi_offset = src_size;

    for (offset = 0U; (offset + 1U) < src_size; offset++) {
        if ((src[offset] == 0xffU) && (src[offset + 1U] == 0xd8U)) {
            info->soi_offset = offset;
            break;
        }
    }

    if (info->soi_offset >= src_size) {
        return RT_FALSE;
    }

    offset = info->soi_offset + 2U;

    while ((offset + 3U) < src_size) {
        uint16_t marker;
        uint16_t seg_len;

        if (src[offset] != 0xffU) {
            offset++;
            continue;
        }

        while (((offset + 1U) < src_size) && (src[offset + 1U] == 0xffU)) {
            offset++;
        }

        if ((offset + 1U) >= src_size) {
            break;
        }

        marker = (uint16_t)(((uint16_t)src[offset] << 8) | src[offset + 1U]);

        if (marker == 0xffc0U) {
            info->has_sof0 = RT_TRUE;
        } else if (marker == 0xffdbU) {
            info->has_dqt = RT_TRUE;
        } else if (marker == 0xffc4U) {
            info->has_dht = RT_TRUE;
        }

