RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
        if (marker == 0xffdaU) {
            info->has_sos = RT_TRUE;
            info->sos_offset = offset;
            break;
        }

        if (marker == 0xffd9U) {
            info->has_eoi = RT_TRUE;
            info->eoi_offset = offset;
            break;
        }

        if ((marker >= 0xffd0U) && (marker <= 0xffd7U)) {
            offset += 2U;
            continue;
        }

        if ((marker == 0xffd8U) || (marker == 0xff01U)) {
            offset += 2U;
            continue;
        }

        seg_len = (uint16_t)(((uint16_t)src[offset + 2U] << 8) | src[offset + 3U]);
        if ((seg_len < 2U) || ((offset + 2U + seg_len) > src_size)) {
            return RT_FALSE;
        }

        offset += 2U + seg_len;
    }

    if (info->has_sos) {
        for (offset = src_size; offset > (info->sos_offset + 1U); offset--) {
            if ((src[offset - 2U] == 0xffU) && (src[offset - 1U] == 0xd9U)) {
                info->has_eoi = RT_TRUE;
                info->eoi_offset = offset - 2U;
                break;
            }
        }
    }

    return RT_TRUE;
}

static rt_err_t uvc_mjpeg_append_bytes(const uint8_t *src, uint32_t copy_size,
                                       uint32_t *out_offset)
{
    if ((src == RT_NULL) || (out_offset == RT_NULL)) {
        return -RT_ERROR;
    }

    if ((*out_offset + copy_size) > sizeof(g_uvc_mjpeg_frame)) {
        return -RT_ERROR;
    }

    memcpy(g_uvc_mjpeg_frame + *out_offset, src, copy_size);
    *out_offset += copy_size;
    return RT_EOK;
}

static rt_err_t uvc_mjpeg_append_standard_dht(uint32_t *out_offset)
{
    uint8_t segment[UVC_MJPEG_STD_DHT_SIZE];
    uint32_t write_offset = 4U;
    unsigned int i;
    const struct {
        uint8_t table_id;
        const uint8_t *bits;
        uint32_t bits_len;
        const uint8_t *values;
        uint32_t values_len;
    } tables[] = {
        { 0x00U, g_uvc_dht_bits_dc_luma, (uint32_t)sizeof(g_uvc_dht_bits_dc_luma), g_uvc_dht_val_dc_luma, (uint32_t)sizeof(g_uvc_dht_val_dc_luma) },
        { 0x10U, g_uvc_dht_bits_ac_luma, (uint32_t)sizeof(g_uvc_dht_bits_ac_luma), g_uvc_dht_val_ac_luma, (uint32_t)sizeof(g_uvc_dht_val_ac_luma) },
        { 0x01U, g_uvc_dht_bits_dc_chroma, (uint32_t)sizeof(g_uvc_dht_bits_dc_chroma), g_uvc_dht_val_dc_chroma, (uint32_t)sizeof(g_uvc_dht_val_dc_chroma) },
        { 0x11U, g_uvc_dht_bits_ac_chroma, (uint32_t)sizeof(g_uvc_dht_bits_ac_chroma), g_uvc_dht_val_ac_chroma, (uint32_t)sizeof(g_uvc_dht_val_ac_chroma) },
    };

    if (out_offset == RT_NULL) {
        return -RT_ERROR;
    }

    segment[0] = 0xffU;
    segment[1] = 0xc4U;

    for (i = 0U; i < (sizeof(tables) / sizeof(tables[0])); i++) {
        uint32_t copy_size = 1U + tables[i].bits_len + tables[i].values_len;

        if ((write_offset + copy_size) > sizeof(segment)) {
            return -RT_ERROR;
        }

        segment[write_offset++] = tables[i].table_id;
        memcpy(&segment[write_offset], tables[i].bits, tables[i].bits_len);
        write_offset += tables[i].bits_len;
        memcpy(&segment[write_offset], tables[i].values, tables[i].values_len);
        write_offset += tables[i].values_len;
    }

    segment[2] = (uint8_t)(((write_offset - 2U) >> 8) & 0xffU);
    segment[3] = (uint8_t)((write_offset - 2U) & 0xffU);
    return uvc_mjpeg_append_bytes(segment, write_offset, out_offset);
}

static rt_err_t uvc_mjpeg_collect_sof0_qt_mask(const uint8_t *segment,
                                               uint16_t seg_len,
                                               uint8_t *qt_mask)
{
    uint32_t payload_size;
    uint8_t ncomp;
    uint8_t i;

    if ((segment == RT_NULL) || (qt_mask == RT_NULL) || (seg_len < 8U)) {
        return -RT_ERROR;
    }

    payload_size = (uint32_t)seg_len - 2U;
    ncomp = segment[9];
    if ((ncomp == 0U) || (payload_size < (uint32_t)(6U + 3U * ncomp))) {
        return -RT_ERROR;
    }

    for (i = 0U; i < ncomp; i++) {
        uint8_t qid = segment[12U + 3U * i];
        if (qid > 3U) {
            return -RT_ERROR;
        }
        *qt_mask |= (uint8_t)(1U << qid);
    }

    return RT_EOK;
}

static rt_err_t uvc_mjpeg_append_dqt_segment(const uint8_t *segment,
                                             uint16_t seg_len,
                                             uint8_t qt_tables[4][64],
                                             uint8_t *defined_qt_mask,
                                             uint32_t *out_offset,
                                             rt_bool_t *normalized_16bit,
                                             rt_bool_t *trimmed_tail)
{
    uint8_t temp[4U + 4U * 65U];
    const uint8_t *data;
    uint32_t ndata;
    uint32_t write_offset = 4U;
    uint8_t local_mask = 0U;

    if ((segment == RT_NULL) || (defined_qt_mask == RT_NULL) ||
        (out_offset == RT_NULL) || (normalized_16bit == RT_NULL) ||
        (trimmed_tail == RT_NULL) || (seg_len < 3U)) {
        return -RT_ERROR;
    }

    data = segment + 4U;
    ndata = (uint32_t)seg_len - 2U;
    temp[0] = 0xffU;
    temp[1] = 0xdbU;

    while (ndata > 0U) {
        uint8_t prop;
        uint8_t precision;
        uint8_t qid;
        uint8_t i;

        prop = *data++;
        ndata--;
        precision = (uint8_t)(prop >> 4);
        qid = (uint8_t)(prop & 0x0fU);

        if (qid > 3U) {
            return -RT_ERROR;
        }

        if (precision == 0U) {
            if (ndata < 64U) {
                if (local_mask != 0U) {
                    *trimmed_tail = RT_TRUE;
                    break;
                }
                return -RT_ERROR;
            }

            temp[write_offset++] = qid;
            memcpy(&temp[write_offset], data, 64U);
            memcpy(qt_tables[qid], data, 64U);
            write_offset += 64U;
            data += 64U;
            ndata -= 64U;
        } else if (precision == 1U) {
            if (ndata < 128U) {
                if (local_mask != 0U) {
                    *trimmed_tail = RT_TRUE;
                    break;
                }
                return -RT_ERROR;
            }

            temp[write_offset++] = qid;
            for (i = 0U; i < 64U; i++) {
                uint16_t value = (uint16_t)(((uint16_t)data[2U * i] << 8) |
                                            data[2U * i + 1U]);
                uint8_t qvalue = (value == 0U) ? 1U : (uint8_t)((value > 255U) ? 255U : value);

