RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
                temp[write_offset + i] = qvalue;
                qt_tables[qid][i] = qvalue;
            }
            write_offset += 64U;
            data += 128U;
            ndata -= 128U;
            *normalized_16bit = RT_TRUE;
        } else {
            return -RT_ERROR;
        }

        local_mask |= (uint8_t)(1U << qid);
    }

    if (write_offset <= 4U) {
        return -RT_ERROR;
    }

    temp[2] = (uint8_t)(((write_offset - 2U) >> 8) & 0xffU);
    temp[3] = (uint8_t)((write_offset - 2U) & 0xffU);
    *defined_qt_mask |= local_mask;
    return uvc_mjpeg_append_bytes(temp, write_offset, out_offset);
}

static rt_err_t uvc_mjpeg_append_missing_qtables(uint8_t used_qt_mask,
                                                 uint8_t *defined_qt_mask,
                                                 uint8_t qt_tables[4][64],
                                                 uint32_t *out_offset,
                                                 uint8_t *duplicated_tables)
{
    uint8_t temp[4U + 4U * 65U];
    uint32_t write_offset = 4U;
    uint8_t fallback_qid = 0xffU;
    uint8_t qid;

    if ((defined_qt_mask == RT_NULL) || (out_offset == RT_NULL) ||
        (duplicated_tables == RT_NULL)) {
        return -RT_ERROR;
    }

    for (qid = 0U; qid < 4U; qid++) {
        if ((*defined_qt_mask & (1U << qid)) != 0U) {
            fallback_qid = qid;
            break;
        }
    }

    if (fallback_qid == 0xffU) {
        return -RT_ERROR;
    }

    temp[0] = 0xffU;
    temp[1] = 0xdbU;

    for (qid = 0U; qid < 4U; qid++) {
        if (((used_qt_mask & (1U << qid)) != 0U) && ((*defined_qt_mask & (1U << qid)) == 0U)) {
            temp[write_offset++] = qid;
            memcpy(&temp[write_offset], qt_tables[fallback_qid], 64U);
            memcpy(qt_tables[qid], qt_tables[fallback_qid], 64U);
            write_offset += 64U;
            *defined_qt_mask |= (uint8_t)(1U << qid);
            (*duplicated_tables)++;
        }
    }

    if (write_offset <= 4U) {
        return RT_EOK;
    }

    temp[2] = (uint8_t)(((write_offset - 2U) >> 8) & 0xffU);
    temp[3] = (uint8_t)((write_offset - 2U) & 0xffU);
    return uvc_mjpeg_append_bytes(temp, write_offset, out_offset);
}

static rt_err_t uvc_mjpeg_prepare_frame(const uint8_t *src, uint32_t src_size,
                                        const uint8_t **jpeg, uint32_t *jpeg_size)
{
    struct uvc_mjpeg_header_info info;
    uint32_t offset;
    uint32_t out_offset = 0U;
    uint32_t dropped_bytes = 0U;
    uint32_t entropy_offset = 0U;
    uint32_t entropy_size;
    uint8_t used_qt_mask = 0U;
    uint8_t defined_qt_mask = 0U;
    uint8_t duplicated_qtables = 0U;
    uint8_t qt_tables[4][64];
    rt_bool_t insert_dht;
    rt_bool_t append_eoi;
    rt_bool_t normalized_dqt16 = RT_FALSE;
    rt_bool_t trimmed_dqt_tail = RT_FALSE;

    if ((src == RT_NULL) || (src_size < 4U) || (jpeg == RT_NULL) || (jpeg_size == RT_NULL)) {
        return -RT_ERROR;
    }

    memset(qt_tables, 0, sizeof(qt_tables));

    if (!uvc_mjpeg_parse_header(src, src_size, &info)) {
        if (g_uvc_mjpeg_diag_budget > 0U) {
            USB_LOG_WRN("MJPEG header parse failed size=%lu\r\n", (unsigned long)src_size);
            g_uvc_mjpeg_diag_budget--;
        }
        return -RT_ERROR;
    }

    if (!info.has_sos || !info.has_sof0 || !info.has_dqt) {
        if (g_uvc_mjpeg_diag_budget > 0U) {
            USB_LOG_WRN("MJPEG header incomplete: sof0=%d dqt=%d dht=%d sos=%d eoi=%d size=%lu\r\n",
                        info.has_sof0, info.has_dqt, info.has_dht,
                        info.has_sos, info.has_eoi, (unsigned long)src_size);
            g_uvc_mjpeg_diag_budget--;
        }
        return -RT_ERROR;
    }

    insert_dht = info.has_dht ? RT_FALSE : RT_TRUE;
    append_eoi = info.has_eoi ? RT_FALSE : RT_TRUE;

    g_uvc_mjpeg_frame[out_offset++] = 0xffU;
    g_uvc_mjpeg_frame[out_offset++] = 0xd8U;

    offset = info.soi_offset + 2U;
    while ((offset + 1U) < src_size) {
        uint32_t marker_start = offset;
        uint16_t marker;
        uint16_t seg_len;
        uint32_t segment_size;

        while ((offset < src_size) && (src[offset] != 0xffU)) {
            offset++;
        }
        dropped_bytes += offset - marker_start;

        while (((offset + 1U) < src_size) && (src[offset + 1U] == 0xffU)) {
            offset++;
            dropped_bytes++;
        }

        if ((offset + 1U) >= src_size) {
            break;
        }

        marker = (uint16_t)(((uint16_t)src[offset] << 8) | src[offset + 1U]);

        if (marker == 0xffd9U) {
            break;
        }

        if ((marker >= 0xffd0U) && (marker <= 0xffd7U)) {
            dropped_bytes += 2U;
            offset += 2U;
            continue;
        }

        if ((marker == 0xffd8U) || (marker == 0xff01U)) {
            dropped_bytes += 2U;
            offset += 2U;
            continue;
        }

        if ((offset + 3U) >= src_size) {
            return -RT_ERROR;
        }

        seg_len = (uint16_t)(((uint16_t)src[offset + 2U] << 8) | src[offset + 3U]);
        if ((seg_len < 2U) || ((offset + 2U + seg_len) > src_size)) {
            return -RT_ERROR;
        }

        segment_size = 2U + seg_len;

        if (marker == 0xffdaU) {
            if ((used_qt_mask & (uint8_t)(~defined_qt_mask)) != 0U) {
                if (uvc_mjpeg_append_missing_qtables(used_qt_mask, &defined_qt_mask,
                                                     qt_tables, &out_offset,
                                                     &duplicated_qtables) != RT_EOK) {
                    return -RT_ERROR;
                }
            }

            if (insert_dht) {
                if (uvc_mjpeg_append_standard_dht(&out_offset) != RT_EOK) {
                    goto frame_overflow;
                }
            }

            if (uvc_mjpeg_append_bytes(src + offset, segment_size, &out_offset) != RT_EOK) {
                goto frame_overflow;
            }

            entropy_offset = offset + segment_size;
            break;
        }

        if (marker == 0xffc0U) {
            if (uvc_mjpeg_collect_sof0_qt_mask(src + offset, seg_len, &used_qt_mask) != RT_EOK) {
                return -RT_ERROR;
            }
            if (uvc_mjpeg_append_bytes(src + offset, segment_size, &out_offset) != RT_EOK) {
                goto frame_overflow;
            }
        } else if (marker == 0xffdbU) {
            if (uvc_mjpeg_append_dqt_segment(src + offset, seg_len, qt_tables,
                                             &defined_qt_mask, &out_offset,
                                             &normalized_dqt16,
                                             &trimmed_dqt_tail) != RT_EOK) {
                return -RT_ERROR;
            }
        } else if ((marker == 0xffc4U) || (marker == 0xffddU)) {
            if (uvc_mjpeg_append_bytes(src + offset, segment_size, &out_offset) != RT_EOK) {
                goto frame_overflow;
            }
        } else {
            dropped_bytes += segment_size;
        }

        offset += segment_size;
    }

    if (entropy_offset == 0U) {
        return -RT_ERROR;
    }

    if (info.has_eoi) {
        if (info.eoi_offset < entropy_offset) {
            return -RT_ERROR;
        }
        entropy_size = info.eoi_offset - entropy_offset;
    } else {
        entropy_size = src_size - entropy_offset;
    }

