RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
    if (uvc_mjpeg_append_bytes(src + entropy_offset, entropy_size, &out_offset) != RT_EOK) {
        goto frame_overflow;
    }

    if ((out_offset + 2U) > sizeof(g_uvc_mjpeg_frame)) {
        goto frame_overflow;
    }
    g_uvc_mjpeg_frame[out_offset++] = 0xffU;
    g_uvc_mjpeg_frame[out_offset++] = 0xd9U;

    if ((g_uvc_mjpeg_diag_budget > 0U) &&
        (insert_dht || append_eoi || (info.soi_offset != 0U) || (dropped_bytes != 0U) ||
         normalized_dqt16 || trimmed_dqt_tail || (duplicated_qtables != 0U))) {
        USB_LOG_WRN("MJPEG patched: dht=%d eoi=%d drop=%lu dqt16=%d dqtdup=%u dqtail=%d size=%lu\r\n",
                    insert_dht, append_eoi,
                    (unsigned long)dropped_bytes, normalized_dqt16,
                    duplicated_qtables, trimmed_dqt_tail,
                    (unsigned long)out_offset);
        g_uvc_mjpeg_diag_budget--;
    }

    *jpeg = g_uvc_mjpeg_frame;
    *jpeg_size = out_offset;
    return RT_EOK;

frame_overflow:
    if (g_uvc_mjpeg_diag_budget > 0U) {
        USB_LOG_ERR("MJPEG frame overflow after patch size=%lu\r\n", (unsigned long)src_size);
        g_uvc_mjpeg_diag_budget--;
    }
    return -RT_ERROR;
}

/* ---- YUYV → RGB565 inline helpers ---- */
static inline int clamp8(int v)
{
    if (v < 0)   return 0;
    if (v > 255) return 255;
    return v;
}

static inline uint16_t yuv_to_rgb565_fast(uint8_t y,
                                          int32_t u_to_b,
                                          int32_t u_to_g,
                                          int32_t v_to_r,
                                          int32_t v_to_g)
{
    int32_t y_term = g_uvc_y_lut[y];
    int r = clamp8((int)((y_term + v_to_r + 128) >> 8));
    int g = clamp8((int)((y_term + u_to_g + v_to_g + 128) >> 8));
    int b = clamp8((int)((y_term + u_to_b + 128) >> 8));

    return (uint16_t)(((r >> 3) << 11) | ((g >> 2) << 5) | (b >> 3));
}

static inline uint16_t rgb888_to_rgb565(uint8_t r, uint8_t g, uint8_t b)
{
    return (uint16_t)(((uint16_t)(r & 0xf8U) << 8) |
                      ((uint16_t)(g & 0xfcU) << 3) |
                      ((uint16_t)b >> 3));
}

static UVC_ITCM_SECTION void uvc_display_prepare_yuv_lut(void)
{
    if (g_uvc_yuv_lut_ready) {
        return;
    }

    for (uint32_t i = 0; i < 256U; i++) {
        int32_t y = (int32_t)i - 16;
        int32_t uv = (int32_t)i - 128;

        if (y < 0) {
            y = 0;
        }

        g_uvc_y_lut[i] = 298 * y;
        g_uvc_u_to_b_lut[i] = 516 * uv;
        g_uvc_u_to_g_lut[i] = -100 * uv;
        g_uvc_v_to_r_lut[i] = 409 * uv;
        g_uvc_v_to_g_lut[i] = -208 * uv;
    }

    g_uvc_yuv_lut_ready = RT_TRUE;
}

static UVC_ITCM_SECTION rt_err_t uvc_display_flush(const struct uvc_update_rect *rect)
{
    cy_en_gfx_status_t status;

    if (!g_uvc_lcd_hw_ready) {
        return -RT_ERROR;
    }

    if ((rect != RT_NULL) && (rect->width > 0U) && (rect->height > 0U) &&
        (rect->x == 0U) &&
        ((g_uvc_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_A) ||
         (g_uvc_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_B) ||
         (g_uvc_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DBI_C) ||
         (g_uvc_gfx_context.dc_context.display_type == GFX_DISP_TYPE_DSI_DBI))) {
        uint32_t start_line = rect->y;
        uint32_t end_line = (uint32_t)rect->y + rect->height;

        if (end_line > LCD_H) {
            end_line = LCD_H;
        }

        status = Cy_GFXSS_TransferPartialFrame(g_uvc_gfxbase, start_line, end_line, &g_uvc_gfx_context);
    } else {
        status = Cy_GFXSS_Set_FrameBuffer(g_uvc_gfxbase, (uint32_t *)lcd_fb, &g_uvc_gfx_context);
    }

    return (status == CY_GFX_SUCCESS) ? RT_EOK : -RT_ERROR;
}

static UVC_ITCM_SECTION rt_err_t uvc_display_hw_init(void)
{
    if (g_uvc_lcd_hw_ready) {
        return RT_EOK;
    }

    /* LCD driver is responsible for GFXSS/panel initialization. */
    memset(&g_uvc_gfx_context, 0, sizeof(g_uvc_gfx_context));

    lcd_fb = (uint16_t *)g_uvc_lcd_fb_mem;
    lcd_fb_size = sizeof(g_uvc_lcd_fb_mem);
    memset(lcd_fb, 0, lcd_fb_size);

    g_uvc_lcd_hw_ready = RT_TRUE;
    return uvc_display_flush(RT_NULL);
}

static UVC_ITCM_SECTION rt_err_t uvc_display_refresh_fb_info(void)
{
    if (!g_uvc_lcd_hw_ready) {
        return -RT_ERROR;
    }

    lcd_fb = (uint16_t *)g_uvc_lcd_fb_mem;
    lcd_fb_size = sizeof(g_uvc_lcd_fb_mem);
    return RT_EOK;
}

static UVC_ITCM_SECTION rt_err_t uvc_display_prepare_geometry(uint16_t src_w, uint16_t src_h)
{
    struct uvc_display_context *ctx = &g_uvc_display_ctx;

    if ((src_w == 0U) || (src_h == 0U)) {
        return -RT_ERROR;
    }

    if (ctx->prepared && (ctx->src_w == src_w) && (ctx->src_h == src_h)) {
        return RT_EOK;
    }

    ctx->src_w = src_w;
    ctx->src_h = src_h;
    ctx->src_stride = (uint32_t)src_w * 2U;
    ctx->dst_w = LCD_W;
    ctx->dst_h = (uint16_t)(((uint32_t)src_h * LCD_W) / src_w);
    if (ctx->dst_h == 0U) {
        ctx->dst_h = 1U;
    }
    if (ctx->dst_h > LCD_H) {
        ctx->dst_h = LCD_H;
    }
    ctx->y_offset = (uint16_t)((LCD_H - ctx->dst_h) / 2U);

    ctx->update_rect.x = 0U;
    ctx->update_rect.y = ctx->y_offset;
    ctx->update_rect.width = LCD_W;
    ctx->update_rect.height = ctx->dst_h;

    for (uint16_t dy = 0; dy < ctx->dst_h; dy++) {
        uint32_t sy = ((uint32_t)dy * src_h) / ctx->dst_h;
        if (sy >= src_h) {
            sy = src_h - 1U;
        }
        ctx->row_offsets[dy] = sy * ctx->src_stride;
    }

    for (uint16_t dx = 0; dx < ctx->dst_w; dx++) {
        uint32_t sx = ((uint32_t)dx * src_w) / ctx->dst_w;
        if (sx >= src_w) {
            sx = src_w - 1U;
        }
        ctx->x_offsets[dx] = (uint16_t)sx;
        ctx->pair_offsets[dx] = (uint16_t)((sx & ~1U) * 2U);
        ctx->y_offsets[dx] = (uint8_t)((sx & 1U) ? 2U : 0U);
    }

    ctx->prepared = RT_TRUE;
    ctx->background_synced = RT_FALSE;
    return RT_EOK;
}

static UVC_ITCM_SECTION void uvc_display_sync_background(void)
{
    if (!g_uvc_display_ctx.background_synced) {
        if (uvc_display_refresh_fb_info() != RT_EOK) {
            return;
        }

