RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
        memset(lcd_fb, 0, lcd_fb_size);
        (void)uvc_display_flush(RT_NULL);

        g_uvc_display_ctx.background_synced = RT_TRUE;
    }
}

static UVC_ITCM_SECTION void uvc_display_rgb565(const uint16_t *src, uint32_t src_size,
                                                uint16_t src_w, uint16_t src_h)
{
    struct uvc_display_context *ctx = &g_uvc_display_ctx;

    if (!lcd_fb || !src || src_size < sizeof(uint16_t)) {
        return;
    }

    if (uvc_display_prepare_geometry(src_w, src_h) != RT_EOK) {
        return;
    }
    uvc_display_sync_background();

    for (uint16_t dy = 0; dy < ctx->dst_h; dy++) {
        const uint16_t *srow;
        uint16_t *drow;

        if ((ctx->row_offsets[dy] + ctx->src_stride) > src_size) {
            break;
        }

        srow = (const uint16_t *)((const uint8_t *)src + ctx->row_offsets[dy]);
        drow = lcd_fb + (ctx->y_offset + dy) * LCD_W;

        for (uint16_t dx = 0; dx < ctx->dst_w; dx++) {
            drow[dx] = srow[ctx->x_offsets[dx]];
        }
    }
}

static size_t uvc_mjpeg_input_func(JDEC *jd, uint8_t *buf, size_t nbyte)
{
    struct uvc_mjpeg_decoder *decoder = (struct uvc_mjpeg_decoder *)jd->device;
    size_t remain;

    if ((decoder == RT_NULL) || (decoder->src == RT_NULL) ||
        (decoder->src_offset >= decoder->src_size)) {
        return 0U;
    }

    remain = (size_t)(decoder->src_size - decoder->src_offset);
    if (nbyte > remain) {
        nbyte = remain;
    }

    if ((buf != RT_NULL) && (nbyte > 0U)) {
        memcpy(buf, decoder->src + decoder->src_offset, nbyte);
    }

    decoder->src_offset += (uint32_t)nbyte;
    return nbyte;
}

static int uvc_mjpeg_output_func(JDEC *jd, void *bitmap, JRECT *rect)
{
    struct uvc_mjpeg_decoder *decoder = (struct uvc_mjpeg_decoder *)jd->device;
    uint16_t block_w;
    uint16_t block_h;

    if ((decoder == RT_NULL) || (bitmap == RT_NULL) || (rect == RT_NULL) ||
        (decoder->dst_rgb565 == RT_NULL)) {
        return 0;
    }

    if ((rect->left >= decoder->width) || (rect->top >= decoder->height)) {
        return 1;
    }

    block_w = (uint16_t)(rect->right - rect->left + 1U);
    block_h = (uint16_t)(rect->bottom - rect->top + 1U);

#if JD_FORMAT == 1
    {
        const uint16_t *src = (const uint16_t *)bitmap;

        for (uint16_t y = 0; y < block_h; y++) {
            uint16_t *dst = decoder->dst_rgb565 +
                            (uint32_t)(rect->top + y) * decoder->width + rect->left;

            memcpy(dst, src + (uint32_t)y * block_w, (size_t)block_w * sizeof(uint16_t));
        }
    }
#else
    {
        const uint8_t *src = (const uint8_t *)bitmap;

        for (uint16_t y = 0; y < block_h; y++) {
            uint16_t *dst = decoder->dst_rgb565 +
                            (uint32_t)(rect->top + y) * decoder->width + rect->left;

            for (uint16_t x = 0; x < block_w; x++) {
                uint8_t b = *src++;
                uint8_t g = *src++;
                uint8_t r = *src++;

                dst[x] = rgb888_to_rgb565(r, g, b);
            }
        }
    }
#endif

    return 1;
}

static rt_err_t uvc_display_mjpeg_decode(const uint8_t *src, uint32_t src_size,
                                         uint16_t *width, uint16_t *height)
{
    struct uvc_mjpeg_decoder decoder;
    struct uvc_mjpeg_validate_info validate_info;
    const uint8_t *jpeg;
    const char *validate_error;
    uint32_t jpeg_size;
    JDEC jd;
    JRESULT result;

    if ((src == RT_NULL) || (src_size < 4U) || (width == RT_NULL) || (height == RT_NULL)) {
        return -RT_ERROR;
    }

    memset(&decoder, 0, sizeof(decoder));
    decoder.dst_rgb565 = g_uvc_mjpeg_rgb565;

    if (uvc_mjpeg_prepare_frame(src, src_size, &jpeg, &jpeg_size) != RT_EOK) {
        return -RT_ERROR;
    }

    decoder.src = jpeg;
    decoder.src_size = jpeg_size;

    validate_error = uvc_mjpeg_validate_jpeg(jpeg, jpeg_size, &validate_info);
    if (validate_error != RT_NULL) {
        if (g_uvc_mjpeg_diag_budget > 0U) {
            USB_LOG_WRN("MJPEG validate failed: %s m=%u wh=%ux%u comp=%u qt=%02x dc=%02x ac=%02x size=%lu\r\n",
                        validate_error, validate_info.marker_count,
                        validate_info.width, validate_info.height,
                        validate_info.ncomp, validate_info.qt_mask,
                        validate_info.dc_mask, validate_info.ac_mask,
                        (unsigned long)jpeg_size);
            g_uvc_mjpeg_diag_budget--;
        }
        return -RT_ERROR;
    }

    result = jd_prepare(&jd, uvc_mjpeg_input_func,
                        g_uvc_mjpeg_workbuf, sizeof(g_uvc_mjpeg_workbuf),
                        &decoder);
    if (result != JDR_OK) {
        USB_LOG_WRN("MJPEG prepare failed: %s src=%lu jpeg=%lu\r\n",
                    uvc_mjpeg_result_string(result),
                    (unsigned long)src_size, (unsigned long)jpeg_size);
        return -RT_ERROR;
    }

    if (((uint32_t)jd.width * (uint32_t)jd.height) > UVC_MJPEG_MAX_PIXELS) {
        USB_LOG_ERR("MJPEG frame too large: %ux%u\r\n", jd.width, jd.height);
        return -RT_ERROR;
    }

    decoder.width = jd.width;
    decoder.height = jd.height;

    result = jd_decomp(&jd, uvc_mjpeg_output_func, 0);
    if (result != JDR_OK) {
        USB_LOG_WRN("MJPEG decode failed: %s src=%lu jpeg=%lu\r\n",
                    uvc_mjpeg_result_string(result),
                    (unsigned long)src_size, (unsigned long)jpeg_size);
        return -RT_ERROR;
    }

    *width = decoder.width;
    *height = decoder.height;
    return RT_EOK;
}

/*
 * Render a YUYV frame to the LCD framebuffer using nearest-neighbour scaling.
 *
 * Camera image (src_w × src_h) is scaled to fill LCD width (LCD_W) while
 * maintaining aspect ratio. Image is centred vertically; remaining areas
 * are left black.
 *
 * YUYV format: [Y0 U0 Y1 V0] per 2 pixels, 4 bytes per 2 pixels.
 */
static UVC_ITCM_SECTION void uvc_display_yuyv(const uint8_t *src, uint32_t src_size,
                                              uint16_t src_w, uint16_t src_h)
{
    struct uvc_display_context *ctx = &g_uvc_display_ctx;

    if (!lcd_fb || !src || src_size < 4)
        return;

