RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/libraries/Common/board/ports/usb/usbh_uvc_display.c
    uvc_display_prepare_yuv_lut();
    if (uvc_display_prepare_geometry(src_w, src_h) != RT_EOK) {
        return;
    }
    uvc_display_sync_background();

    for (uint16_t dy = 0; dy < ctx->dst_h; dy++) {
        const uint8_t *srow;
        uint16_t *drow;
        uint16_t cached_pair = 0xffffU;
        int32_t u_to_b = 0;
        int32_t u_to_g = 0;
        int32_t v_to_r = 0;
        int32_t v_to_g = 0;

        if ((ctx->row_offsets[dy] + ctx->src_stride) > src_size) {
            break;
        }

        srow = src + ctx->row_offsets[dy];
        drow = lcd_fb + (ctx->y_offset + dy) * LCD_W;

        for (uint16_t dx = 0; dx < ctx->dst_w; dx++) {
            uint16_t pair = ctx->pair_offsets[dx];
            uint8_t y_val;

            if (pair != cached_pair) {
                uint8_t u_val = srow[pair + 1U];
                uint8_t v_val = srow[pair + 3U];

                u_to_b = g_uvc_u_to_b_lut[u_val];
                u_to_g = g_uvc_u_to_g_lut[u_val];
                v_to_r = g_uvc_v_to_r_lut[v_val];
                v_to_g = g_uvc_v_to_g_lut[v_val];
                cached_pair = pair;
            }

            y_val = srow[pair + ctx->y_offsets[dx]];
            drow[dx] = yuv_to_rgb565_fast(y_val, u_to_b, u_to_g, v_to_r, v_to_g);
        }
    }
}

/* ---- public API ---- */

int uvc_display_init(void)
{
    if (uvc_display_hw_init() != RT_EOK) {
        USB_LOG_ERR("LCD hardware init failed\r\n");
        return -1;
    }

    if (uvc_display_refresh_fb_info() != RT_EOK) {
        USB_LOG_ERR("LCD framebuffer unavailable\r\n");
        return -1;
    }

    USB_LOG_INFO("LCD: %ux%u %dbpp fb=%p size=%u\r\n",
                 LCD_W, LCD_H, 16,
                 lcd_fb, lcd_fb_size);
    return 0;
}

UVC_ITCM_SECTION void uvc_display_frame(struct usbh_videoframe *frame,
                                        uint16_t src_w, uint16_t src_h)
{
    uint16_t jpeg_w;
    uint16_t jpeg_h;

    if (!frame)
        return;

    if (uvc_display_refresh_fb_info() != RT_EOK || !lcd_fb)
        return;

    if (frame->frame_format == USBH_VIDEO_FORMAT_MJPEG) {
        if (uvc_display_mjpeg_decode(frame->frame_buf, frame->frame_size,
                                     &jpeg_w, &jpeg_h) != RT_EOK) {
            return;
        }

        uvc_display_rgb565(g_uvc_mjpeg_rgb565,
                           (uint32_t)jpeg_w * jpeg_h * sizeof(uint16_t),
                           jpeg_w, jpeg_h);
        (void)uvc_display_flush(&g_uvc_display_ctx.update_rect);
        return;
    }

    /* YUYV rendering */
    uvc_display_yuyv(frame->frame_buf, frame->frame_size, src_w, src_h);

    /* Flush only the active image band to reduce LCD transfer time. */
    (void)uvc_display_flush(&g_uvc_display_ctx.update_rect);
}
